function normalizePersian(text) {

    return String(text)
    // =========================
    // حروف عربی ← فارسی
    // =========================
        .replace(/[يى]/g, 'ی')
        .replace(/[ك]/g, 'ک')
        .replace(/[ۀة]/g, 'ه')
        .replace(/ؤ/g, 'و')
        .replace(/إأآ/g, 'ا')

        // =========================
        // اعداد عربی ← انگلیسی
        // =========================
        .replace(/[٠-٩]/g, digit =>
            String(digit.charCodeAt(0) - 0x0660)
        )

        // =========================
        // اعداد فارسی ← انگلیسی
        // =========================
        .replace(/[۰-۹]/g, digit =>
            String(digit.charCodeAt(0) - 0x06F0)
        )

        // =========================
        // نیم‌فاصله و انواع فاصله
        // =========================
        .replace(/[\u200C\u200D\u200E\u200F]/g, ' ')
        .replace(/\s+/g, ' ')

        // =========================
        // حذف اعراب عربی
        // =========================
        .replace(/[\u064B-\u065F\u0670]/g, '')

        // =========================
        // حروف بزرگ انگلیسی → کوچک
        // =========================
        .toLowerCase()

        // =========================
        // حذف فاصله ابتدا و انتها
        // =========================
        .trim();
}

function focusTextarea(textarea){


    textarea.addEventListener('click', function () {

        this.setSelectionRange(0, 0);

    });

}